/* const buttons = document.querySelectorAll(".button");

buttons.forEach(function (btn) {
    btn.addEventListener("click", function () {
        const answer = btn.nextElementSibling;
        answer.classList.toggle("hidden");
    });
}); */

const faqs1 = [
    {
        question: "Ｑ. 電源はありますか？",
        answer: "Ａ. はい。レンタルにて15A（1500W）まで使用可能です。"
    },
    {
        question: "Ｑ. Wi-Fiはありますか？",
        answer: "Ａ. はい。施設内で無料Wi-Fiをご利用いただけます。"
    },
    {
        question: "Ｑ. サイトに車は何台止められますか？",
        answer: "Ａ. 原則として1台まで乗り入れすることが可能です。利用者の安全のため施設内の移動は最徐行でお願いします。\nこの他のお車：施設の駐車スペースにお停めください。"
    },
    {
        question: "Ｑ. テントは何張可能ですか？",
        answer: "Ａ. 原則として各サイト4人用テント1張＋タープ1張＋乗用車1台を想定しております 。\nお車1台を横付けした状態で、ソロテントを複数張る等は、区画からはみ出さないようにしていただければ複数張りも問題ございません。"
    },
    {
        question: "Ｑ. シャワーは何時まで使えますか？",
        answer: "Ａ. コインシャワーは24時間利用可能です。就寝時間帯はお静かに、また順番などマナーを守ってご利用ください。"
    },
    {
        question: "Ｑ. サイト内での直火は可能ですか。また、焚き火台の貸し出しはありますか？",
        answer: "Ａ. 直火は地面を傷めるため禁止とさせていただいております。焚き火をする際は必ず焚き火台と焚火シートをご利用頂きお楽しみください。\n焚き火台のレンタル（有料）もご用意しております。数に限りがございますので事前のご予約をおすすめします。/n<a href=''>レンタル品一覧</a>"
    },
    {
        question: "Ｑ. 灰の捨て場はありますか？",
        answer: "Ａ. 灰は、灰捨て缶にお願いします。灰捨て缶には、火の付いたままの炭やゴミ等を捨てないでください。"
    },
    {
        question: "Ｑ. 各サイトには水道はありますか？",
        answer: "Ａ. はい。管理棟内には屋内炊事場が、サイト横にも2か所共同炊事場施設を備えております。"
    },
    {
        question: "Ｑ. トイレの場所と数を教えてください。",
        answer: "Ａ. 管理棟やサイト中央に備え付けがございます。\n\n・多機能トイレ\n・女子トイレ洋式×4\n・男子トイレ洋式×2　小便器×3"
    },
    {
        question: "Ｑ. サイトの場所は指定できますか？",
        answer: "Ａ. ご予約時に指定可能です。"
    },
    {
        question: "Ｑ. 夜間の照明はありますか？",
        answer: "Ａ. 場内には適度な照明がございますが22:00に消灯となっております。夜間の移動には懐中電灯などをご持参いただくことをおすすめします。"
    },
    {
        question: "Ｑ. テントの試し張りだけでも利用できますか？",
        answer: "Ａ. はい、可能です。本番キャンプ前の「テント試し張り」「設営練習」「ギアチェック」などで、デイキャンプをご利用いただいております。"
    }
];

const faqs2 = [
    {
        question: "Ｑ. 予約はいつからできますか？",
        answer: "Ａ. ご予約は2か月先の月末まで予約を受け付けております。"
    },
    {
        question: "Ｑ. 日帰りでバーベキューはできますか？",
        answer: "Ａ. はい。通常料金通りではありますが日帰りでの利用も可能です。\nバーベキューに必要な道具等のレンタルもございます。レンタルについては「レンタル・売店」ページもご覧ください。/n<a href=''>リンクはこちら</a>"
    },
    {
        question: "Ｑ. チェックインした後に外出はできますか？",
        answer: "Ａ. 出入りは可能ですが、19:30には出入口を閉門しますので、その時間までにはお戻りください。"
    },
    {
        question: "Ｑ. 予約のキャンセル料はいつから発生しますか？",
        answer: "Ａ. ご利用日の3日前からキャンセル料が発生します。"
    },
    {
        question: "Ｑ. チェックイン・チェックアウトの時間を教えてください。",
        answer: "Ａ. チェックインは11:00から、チェックアウトは10:30までに完全撤収をお願いしております。\nチェックアウト時は、まだお休みの方もいますので、撤収作業などはお静かにお願いいたします。"
    },
    {
        question: "Ｑ. 早めにチェックインすることは可能ですか？",
        answer: "Ａ. サービスとして実施はございませんが、事情がある場合は事前にご相談ください。"
    },
    {
        question: "Ｑ. チェックアウトの延長はできますか？",
        answer: "Ａ. チェックアウト延長は予約が空いている場合に限り当日分の料金をお支払いいただく形での延長対応が可能です。"
    },
    {
        question: "Ｑ. 当日予約は可能ですか？",
        answer: "Ａ. 空きがある場合に限り、当日予約も承っております。お電話でお問い合わせください。"
    },
    {
        question: "Ｑ. 電話での予約は受け付けていますか？",
        answer: "Ａ. はい。お気軽にご連絡ください。"
    },
    {
        question: "Ｑ. グループで隣接サイトを予約できますか？",
        answer: "Ａ. ご予約時に希望をお伺いしますが、予約状況により確約はできませんので予めご了承ください。"
    },
    {
        question: "Ｑ. 雨天時のキャンセル対応はどうなりますか？",
        answer: "Ａ. 基本的には通常キャンセル料金（当日100％、前日50％、３日前より30％）となりますが台風、大雨警報時など運営が困難な場合はキャンセル料はかかりません。"
    },
    {
        question: "Ｑ. 支払い方法には何がありますか？",
        answer: "Ａ. 現金、カード、QR決済、交通系に対応しております。詳細はお問い合わせください。"
    },
    {
        question: "Ｑ. ペットと一緒に泊まれますか？",
        answer: "Ａ. はい、ただし場内では必ずリードを付けてください。\nまた排泄物の処理も必ずお願いしております。ペットがトラブルを起こしてしまった際は、すべて飼い主様の責任でご対応をお願いいたします。"
    },
    {
        question: "Ｑ. ベビーカーでの移動は可能ですか？",
        answer: "Ａ. はい、場内は舗装されていない箇所もありますが、ベビーカーでの移動は可能です。"
    },
    {
        question: "Ｑ. ペットの一時預かりサービスはありますか？",
        answer: "Ａ. 申し訳ありませんが、現在一時預かりのサービスは行っておりません。お客さまご自身で管理をお願いいたします。"
    }
]

const faqs3 = [
    {
        question: "Ｑ. 近くにスーパーやコンビニはありますか？",
        answer: "Ａ. 車で15分圏内にコンビニがございます。\nスーパーはございませんが、当売店でも薪・炭をはじめ、一部食材、コンロ網などのキャンプ日用品を取りそろえていますので、そちらもご利用ください。/n<a href=''>リンクはこちら</a>"
    },
    {
        question: "Ｑ. 受付・売店の営業時間を教えてください。",
        answer: "Ａ. 受付、売店は9:30～19:00までの営業となります。"
    },
    {
        question: "Ｑ. 売店ではどんなものが買えますか？",
        answer: "Ａ. テント、燃料（薪・炭）、調理セット、簡易食材、日用品、などを取り扱っております。\n施設・レンタル・売店ページもご覧ください。<a href=''>リンクはこちら</a>"
    },
    {
        question: "Ｑ. レンタルの事前予約は必要ですか？",
        answer: "Ａ. 数に限りがございますので、事前のご予約をおすすめします。"
    },
    {
        question: "Ｑ. ゴミの分別ルールはありますか？",
        answer: "Ａ. はい。以下のルールをお守りいただきご利用ください。\n＜ご利用ルール＞\n施設利用料として500円／組をいただいております。※ゴミステーションなど施設全般の利用料\nゴミ捨て場：管理棟前ゴミステーション\nゴミ捨て方法：ゴミステーション前に分別方法を記載しております。そちらに従ってお捨てください。ご不明な点がございましたらお気軽にスタッフまでお声掛けください。"
    },
    {
        question: "Ｑ. 音楽の使用に制限はありますか？",
        answer: "Ａ. 音の出るもののご利用はお控えいただいております。"
    },
    {
        question: "Ｑ. 花火はしても大丈夫ですか？",
        answer: "Ａ. 手持ち花火に限り、指定場所・時間内でのみ可能です。打ち上げ花火は禁止とさせていただいております。"
    },
    {
        question: "Ｑ. 消灯時間はありますか？",
        answer: "Ａ. きれいな夜空をお楽しみいただくため消灯は22:00となっております。以降は静かにお過ごしください。"
    },
    {
        question: "Ｑ. 忘れ物の保管期間はどれくらいですか？",
        answer: "Ａ. 忘れ物は1ヶ月間保管しております。お心当たりのある方は、お早めにご連絡ください。"
    },
    {
        question: "Ｑ. 熊（クマ）は出ますか？また安全対策はしていますか？",
        answer: "Ａ. これまで、一度も熊の出没は確認されていません。\nですが安全性を高めるため、場内の一部には野生動物の侵入防止対策を行っております。"
    }
]

const list1 = document.getElementById("faq-list1");
const list2 = document.getElementById("faq-list2");
const list3 = document.getElementById("faq-list3");

function createFAQ(list, faqs) {
    faqs.forEach(faq => {
        const li = document.createElement("li");

        const btn = document.createElement("button");
        btn.className = "button accordion";

        const text = document.createElement("span");
        text.textContent = faq.question;

        const arrow = document.createElement("span");
        arrow.className = "plus";

        const answer = document.createElement("p");
        answer.className = "list";
        answer.innerHTML = faq.answer;

        li.addEventListener("click", () => {
            answer.classList.toggle("open");
            btn.classList.toggle("active");
        });

        btn.appendChild(text);
        btn.appendChild(arrow);

        li.appendChild(btn);
        li.appendChild(answer);
        list.appendChild(li);
    });
}

createFAQ(list1, faqs1);
createFAQ(list2, faqs2);
createFAQ(list3, faqs3);
